fio-test/results/14jobs_worker_off/11-libaio-2.out
job1: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 11 processes

job1: (groupid=0, jobs=11): err= 0: pid=37839: Mon Aug 19 15:30:33 2024
  write: IOPS=3981, BW=3982MiB/s (4175MB/s)(926GiB/238016msec); 0 zone resets
    slat (usec): min=23, max=578, avg=131.24, stdev=45.31
    clat (usec): min=533, max=13438, avg=2621.78, stdev=538.96
     lat (usec): min=609, max=13557, avg=2753.75, stdev=535.47
    clat percentiles (usec):
     |  1.00th=[ 2057],  5.00th=[ 2180], 10.00th=[ 2245], 20.00th=[ 2343],
     | 30.00th=[ 2409], 40.00th=[ 2474], 50.00th=[ 2507], 60.00th=[ 2573],
     | 70.00th=[ 2638], 80.00th=[ 2737], 90.00th=[ 2900], 95.00th=[ 3458],
     | 99.00th=[ 5342], 99.50th=[ 5538], 99.90th=[ 5800], 99.95th=[ 5866],
     | 99.99th=[10290]
   bw (  MiB/s): min= 3346, max= 4630, per=100.00%, avg=3986.67, stdev=21.10, samples=5225
   iops        : min= 3346, max= 4630, avg=3983.54, stdev=21.13, samples=5225
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.25%, 4=96.31%, 10=3.41%, 20=0.01%
  cpu          : usr=3.65%, sys=2.14%, ctx=947895, majf=0, minf=256
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,947760,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3982MiB/s (4175MB/s), 3982MiB/s-3982MiB/s (4175MB/s-4175MB/s), io=926GiB (994GB), run=238016-238016msec

Disk stats (read/write):
    dm-0: ios=0/947196, merge=0/0, ticks=0/2431988, in_queue=2431988, util=100.00%, aggrios=16/473880, aggrmerge=0/0, aggrticks=1/49679, aggrin_queue=49681, aggrutil=100.00%
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme3n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme1n2: ios=39/947760, merge=0/0, ticks=4/97181, in_queue=97185, util=100.00%
  nvme4n2: ios=18/947760, merge=0/0, ticks=2/101755, in_queue=101757, util=100.00%
  nvme2n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme0n2: ios=54/947760, merge=0/0, ticks=4/97797, in_queue=97802, util=100.00%
  nvme3n2: ios=27/947760, merge=0/0, ticks=3/100243, in_queue=100247, util=100.00%
  nvme1n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme4n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n2: ios=30/947760, merge=0/0, ticks=4/99823, in_queue=99828, util=100.00%